#+BEGIN_EXPORT html
---
layout: page
title: Jinja templating with Flask
tagline: " description and examples"
permalink: /jinja-templating-with-flask.html
categories: [Jinja, Python, Flask, literate programming]
tags: [Jinja, Python, Flask]
---
#+END_EXPORT

#+STARTUP: showall indent
#+OPTIONS: tags:nil num:nil \n:nil @:t ::t |:t ^:{} _:{} *:t
#+TOC: headlines 2
#+PROPERTY:header-args :results output :exports both :eval no-export

* Check if Jinja installed

#+begin_src sh  
pip list
#+end_src

#+RESULTS:
#+begin_example
Package      Version
------------ -------
blinker      1.8.1
click        8.1.7
Flask        3.0.3
itsdangerous 2.2.0
Jinja2       3.1.3
MarkupSafe   2.1.5
pip          23.0.1
setuptools   66.1.1
Werkzeug     3.0.2
wheel        0.38.4
#+end_example

* Render Jinja Template example

#+begin_src python :results output
  import jinja2
  from jinja2 import Template
  template = Template("Hello, {{ name }}!")
  result = template.render(name="World")
  print(result)
#+end_src

#+RESULTS:
: Hello, World!

- We imported the ~Template~ class from the ~jinja2~ module;
- We created a ~Template~ object by passing the template string as an
  argument. In this case, the template contains a variable ~{{ name}}~
  which will be replaced with a value when rendered;
- We called the ~render()~ method on the template object, passing a
  dictionary with the variable name and value. This renders the
  template with the provided data;
- Finally, we printed the rendered output string.

** Variable Delimiters (`{{ }}`)

These delimiters are used to output the value of a variable or an
expression within a template.

#+begin_src python
  from jinja2 import Template
  template = Template('Hello, {{ name }}!')
  rendered = template.render(name='Viktoriia')
  print(rendered)
#+end_src

#+RESULTS:
: Hello, Viktoriia!

* Render Jinja variable with filter

#+begin_src python :results output
    import jinja2
    from jinja2 import Template

    # Define a dictionary with data
    data = {
      "name": "John Doe",
      "email": "john.doe@example.com"
    }

    # Create a Jinja template with variables and filters
    template = Template("Name: {{ name|replace('John Doe','Eamon Boyle') }}\nEmail: {{ email|upper }}")

    # Render the template with the data
    output = template.render(data)
    print(output)

#+end_src

#+RESULTS:
: Name: Eamon Boyle
: Email: JOHN.DOE@EXAMPLE.COM

* Whitespaces control in Jinja

Controlling whitespace in Jinja templates helps manage the formatting
of the rendered output more precisely.

- ~{%- ... -%}~: Removes whitespace around block statements;
- ~{{- ... -}}~: Removes whitespace around expressions;

Example Without Whitespace Control:

#+begin_src python :results output
  import jinja2
  from jinja2 import Template

  template_string_no_control = """
  {% for i in range(3) %}
  Loop item: {{ i }}
  {% endfor %}
  """

  template_no_control = Template(template_string_no_control)
  output_no_control = template_no_control.render()
  print(output_no_control)
#+end_src

#+RESULTS:
: 
: 
: Loop item: 0
: 
: Loop item: 1
: 
: Loop item: 2
: 

#+begin_src python :results output
    import jinja2
    from jinja2 import Template

    # Define a Jinja template with whitespace control examples
    template_string = """
    {%- for i in range(3) -%}
    Loop item: {{- i -}}
    {%- endfor -%}
    """

    # Create a Jinja2 Template instance
    template = Template(template_string)

    # Render the template
    output = template.render()

    # Print the output
    print(output)

#+end_src

#+RESULTS:
: Loop item:0Loop item:1Loop item:2

* Escaping

To have Jinja ignore parts of a template that it would otherwise
handle as variables or blocks, you can use several methods to escape
or delimit the parts you want to be treated as plain text.

- Using Raw Tags
  Jinja provides ~{% raw %} ... {% endraw %}~ tags to escape parts of
  the template. Anything within these tags will be rendered as plain
  text and not processed by Jinja.

#+begin_src python :results output
  import jinja2
  from jinja2 import Template

  template_str = '''
  <!DOCTYPE html>
  <html lang="en">
  <head>
      <meta charset="UTF-8">
      <meta name="viewport" content="width=device-width, initial-scale=1.0">
      <title>Jinja Raw Tags Example</title>
  </head>
  <body>
      <h1>Welcome to Jinja Raw Tags Example</h1>
      {% raw %}
      <p>This will not be rendered as a Jinja variable: {{ user_input }}</p>
      {% endraw %}
      <p>This will be rendered as a Jinja variable: {{ user_input }}</p>
  </body>
  </html>
  '''
  template = Template(template_str)
  output = template.render(user_input='Hello, World!')

  print(output)

#+end_src

#+RESULTS:
#+begin_example

<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Jinja Raw Tags Example</title>
</head>
<body>
    <h1>Welcome to Jinja Raw Tags Example</h1>
    
    <p>This will not be rendered as a Jinja variable: {{ user_input }}</p>
    
    <p>This will be rendered as a Jinja variable: Hello, World!</p>
</body>
</html>
#+end_example

* Use Jinja With Flask

When you’re in your active virtual environment, go on and check if
Flask installed:

#+begin_src sh
pip list
#+end_src

#+RESULTS:
#+begin_example
Package      Version
------------ -------
blinker      1.8.1
click        8.1.7
Flask        3.0.3
itsdangerous 2.2.0
Jinja2       3.1.3
MarkupSafe   2.1.5
pip          23.0.1
setuptools   66.1.1
Werkzeug     3.0.2
wheel        0.38.4
#+end_example

* Set up your project directory structure

#+begin_src sh :results verbatim
  tree ~/git/annelida/ballyboe/practice/my_flask_app
#+end_src

#+RESULTS:
: /home/vikky/git/annelida/ballyboe/practice/my_flask_app
: ├── app.py
: └── templates
:     └── index.html
: 
: 2 directories, 2 files


